In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('tel.csv', sep=';')
df.head()

   MUSTERI_NO          TELEFON
0           1      5333371000'
1           2      5354321938'
2           3         3840812'
3           3       545 12 15'
4           4  0212 512 12 78'

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   MUSTERI_NO  19 non-null     int64
 1   TELEFON     19 non-null     object
dtypes: int64(1), object(1)
memory usage: 432.0+ bytes

In [4]:
#columns isimlerini değiştirdim. Küçük harflerle kullanmak daha kolay oluyor.
df.columns = ['musteri_no', 'tel']

In [5]:
#telefon numaralarının başındaki 0,9,+ değerlerini sildim.
df.tel = df.tel.str.replace("'","").str.lstrip('+90')

In [6]:
df.head()

   musteri_no            tel
0           1     5333371000
1           2     5354321938
2           3        3840812
3           3      545 12 15
4           4  212 512 12 78

In [7]:
df.head()

   musteri_no            tel
0           1     5333371000
1           2     5354321938
2           3        3840812
3           3      545 12 15
4           4  212 512 12 78

In [8]:
#boşlukları sildim.
df.tel = df.tel.str.replace(' ', '')

In [9]:
df.head()

   musteri_no         tel
0           1  5333371000
1           2  5354321938
2           3     3840812
3           3     5451215
4           4  2125121278

In [10]:
#uzunluğu 10 olmayan telefon numaraların satırlarını sildim.
for i,v in enumerate(df.tel):
    if len(v) != 10:
        df.drop(i,inplace = True)

In [11]:
df.head()

   musteri_no         tel
0           1  5333371000
1           2  5354321938
4           4  2125121278
5           5  3122441245
6           6  2164414512

In [12]:
#alan kodlarını içeren bir sütun oluşturdum.
df['kodu'] = df.tel.map(lambda x : int(x[0:3]))

In [13]:
df.head()

   musteri_no         tel  kodu
0           1  5333371000   533
1           2  5354321938   535
4           4  2125121278   212
5           5  3122441245   312
6           6  2164414512   216

In [14]:
df1 = pd.read_excel('alan_kodu.xlsx')

In [15]:
df1.head()

             şehir  kodu
0           Adana    322
1        Adıyaman   416
2  Afyonkarahisar    272
3            Ağrı   472
4         Aksaray    382

In [16]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 82 entries, 0 to 81
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   şehir   82 non-null     object
 1   kodu    82 non-null     int64
dtypes: int64(1), object(1)
memory usage: 1.4+ KB

In [17]:
#sabit hatların hangi şehrin alan kodunu içerdiğini görmek için 
#left joini kullanarak tabloları birleştirdim.
df_new = df.merge(df1, how = 'left', on ='kodu')

In [18]:
df_new.head()

   musteri_no         tel  kodu               şehir
0           1  5333371000   533                 NaN
1           2  5354321938   535                 NaN
2           4  2125121278   212  İstanbul (Avrupa)
3           5  3122441245   312             Ankara
4           6  2164414512   216    İstanbul (Asya)

In [19]:
#Nan değerlerin yerini - ile doldurdum.
df_new.fillna('-', inplace =True)

In [20]:
df_new.head()

   musteri_no         tel  kodu               şehir
0           1  5333371000   533                   -
1           2  5354321938   535                   -
2           4  2125121278   212  İstanbul (Avrupa)
3           5  3122441245   312             Ankara
4           6  2164414512   216    İstanbul (Asya)

In [21]:
#hat diye sütun oluşturdum telefon numarası 5 ile başlıyorsa cep telefonu, 
#eğer bir şehrin alan kodunu içeriyorsa sabit hat olduğunu yazdırdım.
for i in range(len(df_new)):  
    if df_new.loc[i,'tel'][0] == '5':
        df_new.loc[i,'hat'] = 'cep telefonu'
    elif df_new.loc[i,'şehir'] != '-':
        df_new.loc[i,'hat'] = 'sabit'

In [22]:
df_new.head()

   musteri_no         tel  kodu               şehir           hat
0           1  5333371000   533                   -  cep telefonu
1           2  5354321938   535                   -  cep telefonu
2           4  2125121278   212  İstanbul (Avrupa)          sabit
3           5  3122441245   312             Ankara          sabit
4           6  2164414512   216    İstanbul (Asya)          sabit

In [23]:
#alan kodu yanlış girilen numaraları eledim
df_new = df_new[df_new.hat.notna()]

In [24]:
df_new.head()

   musteri_no         tel  kodu               şehir           hat
0           1  5333371000   533                   -  cep telefonu
1           2  5354321938   535                   -  cep telefonu
2           4  2125121278   212  İstanbul (Avrupa)          sabit
3           5  3122441245   312             Ankara          sabit
4           6  2164414512   216    İstanbul (Asya)          sabit